In [1]:
import numpy as np
print(np.__version__)
import pandas as pd
print(pd.__version__)

1.13.1
0.20.3

In [2]:
#List manipulation, python list can have multiple data type
sample_list = list(range(10))
print(sample_list)
modified_list = [value+10 for value in sample_list]
print(modified_list)
print([type(value) for value in modified_list])

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
[<type 'int'>, <type 'int'>, <type 'int'>, <type 'int'>, <type 'int'>, <type 'int'>, <type 'int'>, <type 'int'>, <type 'int'>, <type 'int'>]

In [3]:
#numpy list cannot have different data types
np.random.seed(3)
np_list = np.arange(0,10,1)
print(np_list)
np_arr =np.random.normal(0,1,(2,2)) #mean,std,(dimention)
#help(np.random.normal)
print(np_arr)
print(np_arr[0,1])

[0 1 2 3 4 5 6 7 8 9]
[[ 1.78862847  0.43650985]
 [ 0.09649747 -1.8634927 ]]
0.436509850512

In [4]:
np_list2 = np.array(modified_list)
np_list2 = np.concatenate([np_list,np_list2])
print(np_list2)
#np.vstack and np.hstak to vertical and horizontal stacking similar to concatenate

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19]

In [5]:
x1,x2 = np.split(np_list2,[10])
grid = np.concatenate([x2,x1]).reshape(2,10)
print(grid)
#np.vsplit and np.hsplit works similarly

[[10 11 12 13 14 15 16 17 18 19]
 [ 0  1  2  3  4  5  6  7  8  9]]

In [6]:
sample_dict = {'F1':['v1','v2','v3','v4','v5','v6','v7'], 'Value':[val for val in np.random.normal(1,2,(7))]}
sample_data = pd.DataFrame(sample_dict)
sample_data

   F1     Value
0  v1  0.445224
1  v2  0.290482
2  v3  0.834517
3  v4 -0.254001
4  v5  0.912364
5  v6  0.045564
6  v7 -1.627730

In [7]:
sample_data.describe() #It give summary of only integer and floating points columns

          Value
count  7.000000
mean   0.092346
std    0.862924
min   -1.627730
25%   -0.104219
50%    0.290482
75%    0.639870
max    0.912364

In [8]:
#pandas SQL query starts from here***
sample_data = sample_data.append(sample_data, ignore_index=True)
sample_data.sort_values(by=['Value'],ascending=True,inplace=True)
#inplace for inplace sorting
sample_data.sort_values(by='Value')
sample_data = sample_data.drop_duplicates(subset='Value') #If column value is same
print(sample_data)

   F1     Value
6  v7 -1.627730
3  v4 -0.254001
5  v6  0.045564
1  v2  0.290482
0  v1  0.445224
2  v3  0.834517
4  v5  0.912364

In [9]:
#Mapping and apply with lamda function
print(str.lower)

<method 'lower' of 'str' objects>

In [10]:
#dictionary for map, map also work with function
map_dict = {'v1':4, 'v2':2, 'v3':3, 'v4':4, 'v5':5, 'v6':6,'v7':7}
sample_data['F1_num'] = sample_data['F1'].map(map_dict)

#one liner functions lamda, ld = lambda x: x.size()
def sign(num):
    if num>=0:
        return 'positive'
    if num<0:
        return 'negative'

sample_data['sign'] = sample_data['Value'].apply(sign)
sample_data = sample_data.assign(reverse = sample_data['Value']*-1)
sample_data.drop('F1',axis='columns',inplace=True)
print(sample_data)

      Value  F1_num      sign   reverse
6 -1.627730       7  negative  1.627730
3 -0.254001       4  negative  0.254001
5  0.045564       6  positive -0.045564
1  0.290482       2  positive -0.290482
0  0.445224       4  positive -0.445224
2  0.834517       3  positive -0.834517
4  0.912364       5  positive -0.912364

In [11]:
#Use of loc : line of control
#sample_data[row,column]
print(sample_data.loc[:4,['Value','F1_num']])
#iloc is used for numbering in columns
print(sample_data.iloc[:,1:3])

      Value  F1_num
6 -1.627730       7
3 -0.254001       4
5  0.045564       6
1  0.290482       2
0  0.445224       4
2  0.834517       3
4  0.912364       5
   F1_num      sign
6       7  negative
3       4  negative
5       6  positive
1       2  positive
0       4  positive
2       3  positive
4       5  positive

In [12]:
#Making queries
test_data = sample_data[sample_data.sign=='positive']
print(test_data)
#For multiple checks, or operator is not efficient
test_data = sample_data[~sample_data['sign'].isin(['positive'])]
print(test_data)
#making full fledge query
test_data = sample_data.query('reverse == -Value')
test_data = sample_data.query('sign == "positive" | Value < 0')
print(test_data)

      Value  F1_num      sign   reverse
5  0.045564       6  positive -0.045564
1  0.290482       2  positive -0.290482
0  0.445224       4  positive -0.445224
2  0.834517       3  positive -0.834517
4  0.912364       5  positive -0.912364
      Value  F1_num      sign   reverse
6 -1.627730       7  negative  1.627730
3 -0.254001       4  negative  0.254001
      Value  F1_num      sign   reverse
6 -1.627730       7  negative  1.627730
3 -0.254001       4  negative  0.254001
5  0.045564       6  positive -0.045564
1  0.290482       2  positive -0.290482
0  0.445224       4  positive -0.445224
2  0.834517       3  positive -0.834517
4  0.912364       5  positive -0.912364

In [13]:
#Exploring real data

In [18]:
train_data = pd.read_csv("train.csv")
test_data = pd.read_csv("test.csv")
train_data.info()
test_data.info()
print("")
print(train_data.shape)
print(test_data.shape)
print("")
test_data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         30725 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education.num     32561 non-null int64
marital.status    32561 non-null object
occupation        30718 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital.gain      32561 non-null int64
capital.loss      32561 non-null int64
hours.per.week    32561 non-null int64
native.country    31978 non-null object
target            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16281 entries, 0 to 16280
Data columns (total 15 columns):
age               16281 non-null int64
workclass         15318 non-null object
fnlwgt            16281 non-null int64
education         16281 non-null object
education.num     16281 non-null int64
marital.status    16281 non-null object
occupation        15315 non-null object
relationship      16281 non-null object
race              16281 non-null object
sex               16281 non-null object
capital.gain      16281 non-null int64
capital.loss      16281 non-null int64
hours.per.week    16281 non-null int64
native.country    16007 non-null object
target            16281 non-null object
dtypes: int64(6), object(9)
memory usage: 1.9+ MB

(32561, 15)
(16281, 15)

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,target
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K.
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
4,18,NaN,103497,Some-college,10,Never-married,NaN,Own-child,White,Female,0,0,30,United-States,<=50K.

In [21]:
#Checking for missing values
print(test_data.shape[0]-test_data.dropna().shape[0])
#Knowing which are missing by how much
test_data.isnull().sum() #isnull fills true in cells, and sum() sums up true(consider it 1) through rows for each columns

1221

age                 0
workclass         963
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation        966
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      0
native.country    274
target              0
dtype: int64

In [22]:
#To test uniqie values, pd.Series.nunique is the function
test_data.apply(pd.Series.nunique)

age                  73
workclass             8
fnlwgt            12787
education            16
education.num        16
marital.status        7
occupation           14
relationship          6
race                  5
sex                   2
capital.gain        113
capital.loss         82
hours.per.week       89
native.country       40
target                2
dtype: int64

In [ ]:
#Next is data imputation